[
  {
    "__EMPTY_5": "At least 1 out of Industry mentor or Alumni Mentor or Faculty Co-Mentor from outside MRU is required."
  },
  {
    "PROGRAM CHEMISTRY:": "Sl No",
    "__EMPTY": "Name of Faculty",
    "__EMPTY_1": "Designation",
    "__EMPTY_2": "Problem Statement",
    "__EMPTY_3": "IDPaspectInproblemStatement",
    "__EMPTY_4": "facultyComentorFromMRU",
    "__EMPTY_5": "industryMentor",
    "__EMPTY_6": "alumniMentor",
    "__EMPTY_7": "facultyComentorOutsideMRU",
    "__EMPTY_8": "DisciplinesInvovled",
    "__EMPTY_9": "ExpectedOutcome",
    "__EMPTY_10": "SDGs",
    "__EMPTY_11": "societalOrIndustrialImpact"
  },
  {
    "PROGRAM CHEMISTRY:": 1,
    "__EMPTY": "Prof. (Dr.) Jyotsna Pandit",
    "__EMPTY_1": "Professor\r\nHead-Sciences",
    "__EMPTY_2": "\"Develop a low-cost, chemically-based water purification system that can be used in remote or rural areas.”",
    "__EMPTY_3": "The project will Design and Develop a low-cost, portable water purification system using chemical and physical filtration methods that is suitable for use in rural India. Evaluate its efficiency against microbial and chemical contaminants, assess environmental impact, and develop an implementation strategy considering local socio-economic constraints.",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_8": "Chemistry, Engineering, Management, Education",
    "__EMPTY_9": "Research Paper"
  },
  {
    "PROGRAM CHEMISTRY:": 2,
    "__EMPTY": "Prof. (Dr.)  Arpit Sand",
    "__EMPTY_1": "Professor.\r\nProgram Head-Chemistry",
    "__EMPTY_2": "Synthesis of Bio polymer based superabsorbent polymers",
    "__EMPTY_3": "The project  will create a state-of-art infrastructure to develop novel multifunctional superabsorbent hydrogels beads using biopolymers and its derivatives. \r\nThese multifunctional hydrogel bead not only act as soil condition but also act as nutrient supplier for plants.\r\nIn addition to that, these beads will also act as adsorbent of heavy metal ions which generally contaminate the soil. ",
    "__EMPTY_4": "Dr. J P Sharma",
    "__EMPTY_5": "Dr. Ravindre Kumar IOC Faridabad",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Chemistry, ME",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG 2: Zero Hunger \r\nPromotes sustainable agriculture by increasing crop yield and soil fertility., Reduces dependency on chemical fertilizers through controlled nutrient release. Supports smallholder farmers with cost-effective, eco-friendly alternatives.\r\nSDG 6: Clean Water and Sanitation\r\nImproves water retention in arid and semi-arid regions. Reduces irrigation frequency, conserving freshwater resources. Minimizes leaching and runoff of nutrients into groundwater, thus protecting water quality.",
    "__EMPTY_11": "Development of Eco-Friendly Hydrogel Beads\r\nSuccessfully synthesized biodegradable hydrogel beads using natural biopolymers (e.g., chitosan, alginate, starch, cellulose derivatives).\r\nAchieved high water absorbency and retention capacity (multiple times their dry weight).\r\nIntegrated slow-release nutrient systems (e.g., urea, phosphate, potassium salts) into the hydrogel matrix."
  },
  {
    "PROGRAM CHEMISTRY:": 3,
    "__EMPTY": "Prof. (Dr.) S. K. Shukla ",
    "__EMPTY_1": "Professor                          ",
    "__EMPTY_2": "Biobased correosion inhibitors",
    "__EMPTY_3": "The project will explore the development of new efficient sustainable biobased inhibitors for the metals where pickiling process is required",
    "__EMPTY_4": "Dr. V.V. Pathak",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Chemistry/ME",
    "__EMPTY_9": "Resaerch Paper",
    "__EMPTY_10": "Biobased corrosion inhibitors support SDG4, SDG 9 (Industry, Innovation, Infrastructure), and SDG 13 (Climate Action) by reducing environmental impact, promoting green chemistry, and enhancing sustainability.",
    "__EMPTY_11": "Biobased corrosion inhibitors offer eco-friendly alternatives to toxic conventional inhibitors, reducing environmental and health risks. Their adoption can enhance industrial sustainability, lower maintenance costs, and extend equipment life. Research in this area contributes to green chemistry, advancing scientific knowledge and promoting innovation in corrosion prevention across various industries."
  },
  {
    "PROGRAM CHEMISTRY:": 4,
    "__EMPTY": "Prof. (Dr.) Meena Kapahi",
    "__EMPTY_1": "Professor, Director - International Relations                                ",
    "__EMPTY_2": "Development of a Fungal-Based Biofilter for Industrial Wastewater Treatment ",
    "__EMPTY_3": "To design and develop a sustainable fungal-based biofilter for the effective removal of pollutants from industrial wastewater, integrating biological treatment with potential for scalable and eco-friendly application",
    "__EMPTY_8": "Chemistry/Electronics/ Management "
  },
  {
    "PROGRAM CHEMISTRY:": 5,
    "__EMPTY": "Dr. Ekta Rawat",
    "__EMPTY_1": "Asstt. Prof."
  },
  {
    "PROGRAM CHEMISTRY:": 6,
    "__EMPTY": "Dr. A. Jayamani ",
    "__EMPTY_1": "Asst. Prof.",
    "__EMPTY_2": "Interactive e-Content Modules on Inorganic Chemistry Experiments for Virtual Labs",
    "__EMPTY_3": "Designing and scripting standard synthetic experiments, Instructional design and learning outcome mapping and developing virtual lab software (HTML5/Unity/React/JavaScript).",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_8": "Chemistry/CST/Eductation"
  },
  {
    "PROGRAM CHEMISTRY:": 7,
    "__EMPTY": "Dr. Priti Gupta",
    "__EMPTY_1": "Asstt. Prof.                                       ",
    "__EMPTY_2": "Modulating Soil Microenvironment and Amino Acid Availability  to Enhance Plant Productivity",
    "__EMPTY_3": " It allows for a more thorough, innovative, and impactful investigation into the potential of acrylic acid amendment for improving soil health and plant growth, ultimately contributing to more sustainable agricultural practices.",
    "__EMPTY_4": "Dr.Shilpa Sharma",
    "__EMPTY_7": "NA",
    "__EMPTY_9": "RESEARCH PAPER",
    "__EMPTY_10": "SDG1, SDG2 & SDG15",
    "__EMPTY_11": "Modulating the soil microenvironment and amino acid availability to enhance plant productivity holds profound societal, industrial, and intellectual ramifications, directly advancing several Sustainable Development Goals (SDG's). Societally, this approach is a cornerstone for SDG 2 (Zero Hunger) and SDG 1 (No Poverty) by significantly boosting crop yields and nutritional content, thereby improving food security and economic stability, especially for vulnerable smallholder farmers. "
  },
  {
    "PROGRAM CHEMISTRY:": 8,
    "__EMPTY": "Dr. Roopa Rani",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Development of a chemical sensor/ Electrode",
    "__EMPTY_3": "Development of chemical sensors integrates chemistry, materials science, electronics, and data science for real-time, selective, and cost-effective analyte detection",
    "__EMPTY_5": "NA",
    "__EMPTY_8": "ECE",
    "__EMPTY_10": "SDG9"
  },
  {
    "PROGRAM CHEMISTRY:": 9,
    "__EMPTY": "Dr. Vinayak V Pathak",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Development of Biolubricant from algal biomass cultivated in municipal wastewater",
    "__EMPTY_3": "Following interdisciplinary aspects are involved in the project: (1) Co invetigator from biotechnology will be involved  for growth optimization and exraction studies. (2) Co- Investigator from chemistry will be involved for  desigining efficient pathway for conversion of algal extract in to biolubricant (3) Co Investigator from Mechanical Engineering will be involved to study the effuucacy of biolubricant in engineering applications.",
    "__EMPTY_4": "Dr. Pooja Parmar",
    "__EMPTY_5": "Dr. M.K. Pandey , Joint Director, DRDO Hqr, New Delhi",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "SOS . SOE and MRCPS",
    "__EMPTY_9": "Research Paper and Patent ",
    "__EMPTY_10": "SDG 6 AND SDG 7 ",
    "__EMPTY_11": "Algae-based biolubricants have the potential to significantly impact both society and industry by offering a sustainable and eco-friendly alternative to conventional petroleum-based lubricants. Derived from renewable algal biomass, these biolubricants are biodegradable, non-toxic, and have a lower environmental footprint, thereby reducing pollution and contributing to cleaner air, water, and soil. For society, this means improved public health and a reduced risk of harmful chemical exposure, particularly in agricultural and urban settings where lubricant runoff is common. In the industrial sector, algae-based biolubricants can enhance machinery performance through superior lubricity, thermal stability, and longer service life, leading to reduced maintenance costs and energy consumption. Additionally, the cultivation and processing of algae for lubricant production can create green jobs and promote rural development, aligning with circular economy principles. As industries move toward decarbonization and sustainable practices, algae-based biolubricants present a promising solution that bridges environmental responsibility with economic growth."
  }
]