[
  {
    "__EMPTY_6": "At least 1 out of Industry mentor or Alumni Mentor or Faculty Co-Mentor from outside MRU is required."
  },
  {
    "__EMPTY": "S.No",
    "__EMPTY_1": "Name of Faculty",
    "__EMPTY_2": "Designation",
    "__EMPTY_3": "Problem Statement",
    "__EMPTY_4": "IDPaspectInproblemStatement",
    "__EMPTY_5": "facultyComentorFromMRU",
    "__EMPTY_6": "industryMentor",
    "__EMPTY_7": "alumniMentor",
    "__EMPTY_8": "facultyComentorOutsideMRU",
    "__EMPTY_9": "DisciplinesInvovled",
    "__EMPTY_10": "ExpectedOutcome",
    "__EMPTY_11": "SDGs",
    "__EMPTY_12": "State the Expected Impact on Society or Industry or Contribution to New Knowledge"
  },
  {
    "__EMPTY": 1,
    "__EMPTY_1": "Prof (Dr.) Sugandha Singh",
    "__EMPTY_2": "Professor ",
    "__EMPTY_3": "Smart Vertical farming",
    "__EMPTY_4": "An indoor, multi-layered (03) agricultural system that utilizes technology to optimize plant growth conditions, enabling year-round, high-yield food production in controlled environments.",
    "__EMPTY_5": "Pool is open",
    "__EMPTY_6": "Looking for",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "1. Ms Bhawana, IIT Gawhati, \r\n2. Dr. Nitesh Kumar Chourasia, Asst Prof, \r\nDepartment of Physics, School of Energy Technology, \r\nPandit Deendayal Energy University, Gandhinagar\r\n3. Dr. Nitesh Singh, Asst Prof \r\nDepartment of Plant Protection, Faculty of Agricultural Sciences, \r\nSGT University, Gurugram",
    "__EMPTY_9": "CSE, Agriculture, IoT, Mechanical",
    "__EMPTY_10": "Research Paper, Patent, Prototype, Product",
    "__EMPTY_11": "SDG 2 and SDG 12",
    "__EMPTY_12": "Promote Agriculture, sustainable environment, economic prospects, water conservation, land conservation"
  },
  {
    "__EMPTY": 2,
    "__EMPTY_1": "Prof. (Dr.) Sachin Lakra",
    "__EMPTY_2": "Professor,\r\nAssoc. Dean-Academics (Engg. & Mgmt.)",
    "__EMPTY_3": "Developing an activeness measure of the hydrogen atom.",
    "__EMPTY_4": "Activeness measures are holistic measures from computer science which can be applied to any system to find the degree of readiness of that system to respond to external stimuli.\r\nDisciplines involved: Computer Science for Simulation, Physics for the Hydrogen atom, Chemistry for the Impact on Climate",
    "__EMPTY_5": "Dr. Dinesh Kumar Sharma, Physics\r\nDr. Vinayak Vandan Pathak, Chemistry",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. T V Prasad, Godavari Global University, Rajahmundry, Andhra Pradesh",
    "__EMPTY_9": "CST, Physics, Chemistry",
    "__EMPTY_10": "Research paper",
    "__EMPTY_11": "SDG 13",
    "__EMPTY_12": "The project will contribute to the creation of new knowledge and insights into the working of an atom as a holistic system."
  },
  {
    "__EMPTY": 3,
    "__EMPTY_1": "Prof. (Dr.) Manpreet Kaur",
    "__EMPTY_2": "Professor,CST\r\n",
    "__EMPTY_3": "An AI powered Chatbot for Legal information retrieval",
    "__EMPTY_4": "This problem requires an interdisciplinary solution that combines expertise from legal studies, to ensure the accuracy and reliability of legal content, and computer science, specifically in natural language processing (NLP) and machine learning, to enable the chatbot to comprehend and generate human-like legal responses.\r\nDisciplines involved: Computer Science & Engineering , AI & Natural language processing and Law",
    "__EMPTY_5": "Dr. Tarundeep Kaur",
    "__EMPTY_6": "Dr. Ritesh Srivastav,\r\nNLP Engineer,\r\nOracle India Pvt Lts",
    "__EMPTY_7": "Mr. Sarthak Rastogi,\r\nAI Engineer\r\nTime and Space Labs\r\n",
    "__EMPTY_8": "Dr. Priti Bansal , Assistant Professor, NSUT",
    "__EMPTY_9": "CST, Law",
    "__EMPTY_10": "Prototype",
    "__EMPTY_11": 16,
    "__EMPTY_12": "This chatbot will  access to legal information by offering round-the-clock, cost-effective, and user-friendly assistance promoting legal awareness in society "
  },
  {
    "__EMPTY": 4,
    "__EMPTY_1": "Dr. Chandni Magoo",
    "__EMPTY_2": "Asstt. Prof., Assoc.HoD-CST",
    "__EMPTY_3": "AI based Smart IoT Powered Food Freshness Monitoring and Waste Reduction System.",
    "__EMPTY_4": "The AI based and IoT Powered Smart Food Freshness Monitoring and Waste Reduction System is an IoT-enabled Smart monitoring system that can be embedded in refrigerator that employs sensors, a camera, and a Raspberry Pi integrated system to with deep learning algorithms to monitor and predict the freshness of food items (fresh or rotten). The system will provide alerts and status updates on a built-in fridge display and thus enabling users to reduce food spoilage. \r\n",
    "__EMPTY_5": "Nitu Chauhan",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Ms. Mrinal Manjri",
    "__EMPTY_9": "Electronics and TeleCommunications",
    "__EMPTY_10": "Reserach Paper, Prototype,Patent,innovation",
    "__EMPTY_11": "SDG 3 (Good Health and Well-Being) , SDG 9 (Industry, Innovation and Infrastructure)"
  },
  {
    "__EMPTY": 5,
    "__EMPTY_1": "Prof. (Dr.) Jyoti Pruthi ",
    "__EMPTY_2": "Prof., Admission Chairperson             "
  },
  {
    "__EMPTY": 0,
    "__EMPTY_1": "Prof. (Dr.) Parneeta Dhaliwal",
    "__EMPTY_2": "Professor, Director-IIC ",
    "__EMPTY_3": "AI based Milk Bottle for Kids",
    "__EMPTY_4": "The AI-enabled milk bottle for children integrates advanced sensors, connectivity, and machine learning to revolutionize infant feeding routines. Equipped with embedded sensors, the bottle continuously monitors temperature, volume intake, and feeding duration, transmitting real-time data to a companion mobile app. The AI algorithms analyze feeding patterns—such as feed frequency, duration, and volume—to detect irregularities and predict optimal feeding schedules.",
    "__EMPTY_5": "Dr. J.P. Sharma",
    "__EMPTY_6": "Mr. Yogesh Chauhan, HCL Technologies",
    "__EMPTY_7": "Mr. Suyash ",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CST, ME, ECE",
    "__EMPTY_10": "Patent, Product, Startup",
    "__EMPTY_11": "SDG 3 (Good Health and Well-Being) , SDG 9 (Industry, Innovation and Infrastructure)",
    "__EMPTY_12": "It will help to ease the life of new parents where the couple is a working couple."
  },
  {
    "__EMPTY": 7,
    "__EMPTY_1": "Prof. (Dr.) Prinima Gupta ",
    "__EMPTY_2": "Prof., Director-Ph.D Prog.",
    "__EMPTY_3": "Clinically Interpretable System for Early Prediction and Risk Stratification of Liver Cirrhosis",
    "__EMPTY_4": "Despite rapid advances in artificial intelligence, healthcare systems in many regions still struggle with early disease detection, especially in remote or underserved communities. Existing AI models often fail to generalize across populations due to lack of diverse data, poor interoperability between health systems, and limited consideration of ethical concerns like bias, data privacy, and informed consent. Aim is to develop a multimodal AI system for non-invasive, early prediction of liver cirrhosis which ensures clinical interpretability and ease of integration into hospital workflows.\r\n",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr Sumita Mukheerji, Dr Pinki Sagar",
    "__EMPTY_9": "CST",
    "__EMPTY_10": "Research Paper, Patent",
    "__EMPTY_11": "SDG-3"
  },
  {
    "__EMPTY": 8,
    "__EMPTY_1": "Prof. (Dr.) Mrinal Pandey",
    "__EMPTY_2": "Professor             ",
    "__EMPTY_3": "Analyzing Trends and Triggers in Autoimmune Diseases: A Data-Driven Approach",
    "__EMPTY_4": "Autoimmune diseases, characterized by the immune system's misguided attack on healthy tissues, have become increasingly prevalent across global populations. This project aims to analyze the trends, triggers, and contributing factors of autoimmune disorders through a data-driven lens. By compiling and examining clinical, genetic, environmental, and lifestyle datasets, the study seeks to identify common patterns and correlations that contribute to the onset and progression of conditions such as rheumatoid arthritis, lupus, and multiple sclerosis. Statistical tools and machine learning techniques are employed to detect emerging trends, regional variations, and potential risk factors. The findings highlight the multifactorial nature of autoimmune diseases, emphasizing the interplay between genetic predisposition and external triggers like infections, stress, and environmental pollutants. This research contributes to a deeper understanding of autoimmune pathogenesis and paves the way for early detection strategies and personalized treatment approaches."
  },
  {
    "__EMPTY_3": "Impact of Social Media on Student Mental Health: Addiction, anxiety, and academic performance.",
    "__EMPTY_4": "The increasing prevalence of social media usage among students has sparked growing concern regarding its impact on mental health and academic performance. This study explores the multifaceted effects of social media on student well-being, focusing specifically on addiction, anxiety, and academic outcomes. Through a combination of surveys, interviews, and academic performance data, the research examines patterns of usage and their correlation with psychological stress, feelings of isolation, sleep disruption, and reduced academic productivity. The findings suggest that excessive engagement with social media platforms contributes significantly to heightened levels of anxiety and reduced focus, which, in turn, negatively affect academic performance. This project underscores the urgent need for awareness, digital literacy, and balanced usage strategies to mitigate the adverse consequences of social media on students' mental health."
  },
  {
    "__EMPTY": 9,
    "__EMPTY_1": "Dr. Abhishek Saxena",
    "__EMPTY_2": "Assoc. Prof.       ",
    "__EMPTY_3": "Detection & Prognosis of Cardio Vascular Disease ",
    "__EMPTY_4": "The Cardiovascular Disease is a combination of various heart disease and is hence a silent killer across the globe. It's early diagnosis and detection is a challenge and is highly dependable on the expertise and clinical & scientific tests that are available.But these methods are very time consuming,costly & lengthy.The use of AI,IoT & Sensors can be helpful to know its actual cause so that its prognosis can be made.The study indicates scope of its detection on the basis of the these techniques and will be helpful to find the actual detection in its early stage.",
    "__EMPTY_5": "Dr. Awab Mohd",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Prof(Dr.) Neeta Verma",
    "__EMPTY_9": "ECE/SoE",
    "__EMPTY_10": "1. Research Paper\r\n2.Prototype\r\n3. Patent",
    "__EMPTY_11": "The Project aims to deliver a feasible solution for the early prediction of CVD to safeguard the life of affected person.\r\n(SDG-3)",
    "__EMPTY_12": "The Project emphasized on the Early diagnosis of disease by delivering a solution so that the both the Practioner and the Patient can be able to able to use it friendly.Hence it should be Cost Effective,Easy to adapt and human friendly.\r\n"
  },
  {
    "__EMPTY": 10,
    "__EMPTY_1": "Mr. Agha Imran Hussain",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "An Interdisciplinary Framework for Cybersecurity: Integrating Technical Architectures, Legal Protocols, and Human-Centric Risk Mitigation",
    "__EMPTY_4": "As cyber threats grow in complexity, traditional technical solutions are no longer sufficient to protect sensitive data and critical infrastructure. The increasing integration of technology into everyday life has exposed vulnerabilities not only in systems but also in human behavior, legal frameworks, and organizational structures. There is a pressing need for an interdisciplinary approach that bridges gaps between technical innovation, legal regulation, human behavior, and ethical responsibility to effectively address and mitigate cybersecurity threats.",
    "__EMPTY_5": "Dr.J.P.Sharma",
    "__EMPTY_6": "Mr.Karan Aditya Ghoshal,   KPMG ,CANADA",
    "__EMPTY_7": "Mr.Samarth Khandelwal",
    "__EMPTY_8": "Mr.Sanjay Kumar,Galgotia University",
    "__EMPTY_9": "School of Law,Education,Management,Sciences",
    "__EMPTY_10": "Research paper\r\nCopyright\r\nPrototype\r\nPatent\r\nProduct\r\nStartup\r\nInnovation\r\nNewspaper Article\r\nVlog/Blog",
    "__EMPTY_11": "SDG 9: Industry, Innovation, and Infrastructure.  SDG 16: Peace, Justice, and Strong Institutions   SDG 4: Quality Education",
    "__EMPTY_12": "For society, it will enhance digital safety by reducing cyber threats, increase digital literacy through targeted training, and promote equitable access to secure technologies, fostering social resilience and public trust in digital systems. In industry, the framework will strengthen critical infrastructure, ensure regulatory compliance, and drive innovation in cybersecurity solutions, boosting competitiveness and creating job opportunities in tech-driven sectors. Additionally, the project will contribute to new knowledge by developing a pioneering interdisciplinary cybersecurity model, generating insights into human behavior and legal-ethical frameworks, and advancing data-driven threat detection methodologies, thus enriching fields like computer science, psychology, and policy studies."
  },
  {
    "__EMPTY": 11,
    "__EMPTY_1": "Mr. Ankur Kr. Aggarwal",
    "__EMPTY_2": "Asstt. Prof."
  },
  {
    "__EMPTY": 12,
    "__EMPTY_1": "Mr. Anup Singh ",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "Analysis on Forecasting Earthquakes using Predictive Machine Learning Algorithms"
  },
  {
    "__EMPTY": 13,
    "__EMPTY_1": "Ms. Anu Priya Sharma",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "Sustainable Datacenters: A systematic approach for making energy efficient Datacenters",
    "__EMPTY_4": "Problem: A large hyperscale data center can emit 100,000 to 200,000 metric tons of CO₂ equivalent per year, depending on energy source and efficiency.\r\n\r\nSolution: Making the datacenters sustainable using energy aware techniques like renewable source of energy, Power aware techniques or Thermal aware techniques. Lots of work required for Energy efficent techniques at software level, Hardware level & Network level. (Relevent for: Electronics, Mechanical, Electrical)",
    "__EMPTY_5": "Dr. Sanjay Singh",
    "__EMPTY_6": "Mr Gaurav Saini",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. Gagangeet Singh Aujala",
    "__EMPTY_9": "Mechanical, Electrical",
    "__EMPTY_10": "Prototype/Research paper",
    "__EMPTY_11": "SDG9, SDG13",
    "__EMPTY_12": "This project is expected to have a significant impact on both the IT industry and climate change by promoting responsible energy consumption in data centers."
  },
  {
    "__EMPTY": 14,
    "__EMPTY_1": "Dr. Deepti Thakral",
    "__EMPTY_2": "Assoc. Prof.       ",
    "__EMPTY_3": "IoT-Based Accident Detection and Alert System",
    "__EMPTY_4": "Equipped with GPS and accelerometer sensors, this system detects vehicle accidents and instantly sends location-based alerts to emergency services and family members.",
    "__EMPTY_5": "Dr. Kavita Singh",
    "__EMPTY_6": "Dr. Ekta Bhayana",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. Parikshit Vasisht",
    "__EMPTY_9": "CSE, ECE, ME, R&AI",
    "__EMPTY_10": "Prototype/Research paper/Patent",
    "__EMPTY_11": "SDG 9, SDG 11",
    "__EMPTY_12": "The proposed system is expected to significantly enhance road safety by enabling real-time accident detection and immediate emergency alerts using GPS and accelerometer-based sensing. Its deployment can reduce the response time of emergency services, thereby minimizing fatalities and serious injuries."
  },
  {
    "__EMPTY": 15,
    "__EMPTY_1": "Ms. Deepanshi Gupta",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "Smart Health Monitoring System using IoT and Machine Learning",
    "__EMPTY_4": "This project involves developing a wearable health monitoring device that collects real-time physiological data (such as heart rate, temperature, SpO2, and ECG) using IoT sensors. The data is transmitted to a cloud platform for storage and analysis. Using machine learning algorithms, the system can detect anomalies and predict potential health issues like arrhythmias or fever spikes. The system also includes a mobile/web interface for both patients and doctors, offering alerts and health insights.",
    "__EMPTY_5": "Dr. Nitika",
    "__EMPTY_6": "Mr. Mayank ",
    "__EMPTY_7": "Somesh Verma",
    "__EMPTY_8": "Khushbu Gupta",
    "__EMPTY_9": "Mechanical, Electrical",
    "__EMPTY_10": "1. Research Paper\r\n2.Prototype\r\n3. Patent",
    "__EMPTY_11": "\r\nA smart wearable device enables real-time health monitoring and early detection of medical anomalies using IoT and machine learning. It improves access to preventive healthcare, supporting SDG 3 (Good Health and Well-Being) and SDG 9 (Industry, Innovation and Infrastructure).\r\n"
  },
  {
    "__EMPTY": 16,
    "__EMPTY_1": "Ms. Esha Khanna",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "Approach to E-Waste Management: Sustainable Solutions for a Digital World",
    "__EMPTY_4": "E-waste is the fastest-growing waste stream globally, yet current management remains fragmented due to gaps in technology, awareness, and policy. An interdisciplinary approach is needed, involving CSE, ECE, ME, Robotics & AI, and Sciences to develop smart, sustainable solutions. This project aims to integrate digital tools, automation, and environmental insights for efficient and responsible e-waste management.",
    "__EMPTY_5": "Ms. Tamanna Sachdeva",
    "__EMPTY_6": "Mr. Rohit Chopra",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. Rashmi Popli, Associate professor, J. C. Bose University of Science & Technology, YMCA",
    "__EMPTY_9": "CSE, ECE, ME, R& AI, Sciences",
    "__EMPTY_10": "Research Paper, Patent",
    "__EMPTY_11": "SDG 11 – Sustainable Cities and Communities, SDG 12 – Responsible Consumption and Production\r\n\r\n",
    "__EMPTY_12": "Innovation in Recycling Technologies: Engineering and scientific insights will drive the development of cost-effective, scalable recycling solutions tailored for local needs."
  },
  {
    "__EMPTY": 17,
    "__EMPTY_1": "Dr. K. Deepa",
    "__EMPTY_2": "Assoc. Prof.       ",
    "__EMPTY_3": "AI-Powered Performance Analysis and Training Optimization for Sub-Junior Badminton Athletes",
    "__EMPTY_4": "This project brings together ideas from different fields like sports science, artificial intelligence (AI), biomechanics, and data analysis. It aims to make training for sub-junior badminton players smarter and more effective. Using AI, we can check players’ movements, find mistakes, and give them quick, personalized feedback. Biomechanics helps us understand how their bodies move, and data analysis shows patterns in their performance. Psychology also plays a role by helping to keep young players motivated and focused. By combining all these areas, the project creates a modern training system that helps young athletes improve their skills faster, avoid injuries, and become better players overall.",
    "__EMPTY_5": "Dr.Sachin Lakra",
    "__EMPTY_6": "Dr.D.Devasena",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr.D.Devasena, Assosicate Professor SREC-Coimbatore",
    "__EMPTY_9": "ECE,CSE,R&AI,Education",
    "__EMPTY_10": "patent",
    "__EMPTY_11": "SDG 3: Good Health and Well-Being\r\nBy optimizing training and reducing the risk of injury through biomechanics and AI-driven monitoring, the project supports physical health and mental well-being among young athletes.\r\n\r\nSDG 17: Partnerships for the Goals\r\nCollaborations between technologists, coaches, sports scientists, and psychologists demonstrate interdisciplinary partnerships aimed at sustainable youth development.\r\n\r\n",
    "__EMPTY_12": "This project is expected to positively impact society by promoting healthier lifestyles and improved athletic development among young children. It introduces advanced, AI-driven training methods that make coaching more effective and personalized. For the sports industry, it opens new avenues in sports technology and youth training solutions. Academically, it contributes new knowledge at the intersection of AI, biomechanics, and sports science, particularly in understanding and enhancing performance in sub-junior athletes."
  },
  {
    "__EMPTY": 18,
    "__EMPTY_1": "Dr. Gunjan Chandwani",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "EconoHealth: Visual Correlation Between Socioeconomic Status and Healthcare Access\"",
    "__EMPTY_4": "Builds an interactive map/dashboard to show how income levels, insurance access, and location affect healthcare availability and outcomes. Aids NGOs and policymakers\r\n🌐 Core Features\r\n📊 Interactive Dashboard\r\nReal-time filters to compare:\r\nIncome brackets (low/middle/high)\r\nInsurance status (insured vs uninsured)\r\nUrban vs rural regions\r\nAge and gender demographics\r\nHealthcare accessibility indicators:\r\nNumber of hospitals/clinics per 1000 people\r\nAverage distance to nearest healthcare facility\r\nEmergency response time (avg)\r\nPreventive care access (vaccination, screening rates)\r\nMortality and morbidity rates\r\n🗺️ Geo-Mapped Insights\r\nHeatmaps showing:\r\nHealthcare deserts\r\nRegional disparities in access to primary/secondary/tertiary care\r\nDistribution of chronic diseases (e.g. diabetes, hypertension)\r\nToggle between districts/states/countries for comparison\r\n📈 Time Series Analysis\r\nTracks healthcare access and outcomes over time (pre/post policy interventions, pandemics, etc.)\r\nIdentify trends and patterns in public health improvements or declines\r\n📌 Predictive Modeling (Optional Advanced Feature)\r\nML models to forecast:\r\nAreas at risk of becoming healthcare deserts\r\nImpacts of income shocks on healthcare usage\r\nOptimal placement of new health facilities for maximum coverage",
    "__EMPTY_5": "Dr.Monika Garg,Dr.Narender,Dr.Animesh ",
    "__EMPTY_6": "Ms.Roshi Saxena",
    "__EMPTY_7": "Mr.Rahul Roy",
    "__EMPTY_8": "Dr.Dharamender Kumar Singh,Associate Professor,Sharda University",
    "__EMPTY_9": "CST,MGT",
    "__EMPTY_10": "1. Research Paper\r\n2.Prototype\r\n3. Patent",
    "__EMPTY_11": "SDG 9, SDG 11",
    "__EMPTY_12": "EconoHealth is a data visualization and analytics platform that explores how socioeconomic status (SES)—including factors like income, education, and employment—affects healthcare access, such as hospital availability, insurance coverage, and quality of care."
  },
  {
    "__EMPTY": 19,
    "__EMPTY_1": "Ms. Jyoti Nanwal",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "AI/ML-Driven Dynamic Agro-Optimization",
    "__EMPTY_4": "AI/ML-Driven Dynamic Agro-Optimization is a precision farming framework designed to boost the yield significantly. It leverages advanced machine learning techniques for real-time soil intelligence, optimized fertilizer application, and accurate weed detection. This integrated approach enables data-driven decision-making, enhancing productivity and sustainability in agriculture.",
    "__EMPTY_5": "Dr. Neelu",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CST",
    "__EMPTY_10": "Research Paper",
    "__EMPTY_11": "SDG9",
    "__EMPTY_12": "Help the Farmers in precision farming"
  },
  {
    "__EMPTY": 20,
    "__EMPTY_1": "Dr. Mamta Arora",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "AI enabled voice assistant for Farmers",
    "__EMPTY_4": "An AI-enabled voice assistant for farmers, like KissanGPT or Farmer.CHAT, offers real-time agricultural advice, weather updates, and market price information in multiple languages, empowering farmers with knowledge and facilitating informed decision-making.",
    "__EMPTY_5": "Dr. Mrinal Pandey",
    "__EMPTY_6": "Mr. Ravi Kant, Xebia",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CSE/ECE",
    "__EMPTY_10": "Prototype",
    "__EMPTY_11": "SDG9",
    "__EMPTY_12": "Help the Farmers through Multilingual Support."
  },
  {
    "__EMPTY": 21,
    "__EMPTY_1": "Dr. Manoj Kumar\r\nKindly confirm who is the faculty lead mentor and who is the faculty co-mentor.",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "Automated Detection and Classification of Diabetic Retinopathy using Advanced Computational Techniques",
    "__EMPTY_4": "1. Helps in developing imaging devices and integrating automated systems with existing medical hardware.\r\n2. Involves the application of engineering principles to design and implement diagnostic tools compatible with clinical systems",
    "__EMPTY_5": "Dr. Urmila Pilania",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. Girija, FET, MRIIRS",
    "__EMPTY_9": "CST",
    "__EMPTY_10": "Paper and patent and App",
    "__EMPTY_11": "SDG 3: Good Health and Well-being\r\nSDG 9: Industry, Innovation, and Infrastructure \r\n",
    "__EMPTY_12": "1. Development of a reliable automated system capable of identifying early signs of diabetic retinopathy (DR) from retinal images with high accuracy, sensitivity, and specificity.\r\n2. Effective categorization of diabetic retinopathy into various stages (e.g., mild, moderate, severe, proliferative) to support timely clinical intervention.\r\n3. Automation will significantly reduce the time and resources needed for manual screening, especially in rural and resource-limited settings."
  },
  {
    "__EMPTY": 22,
    "__EMPTY_1": "Dr. Meena Chaudhary",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "Implementing Continuous Integration and Continuous Deployment (CI/CD) Pipelines to Enhance Software Delivery Efficiency",
    "__EMPTY_4": "​Implementing Continuous Integration and Continuous Deployment (CI/CD) pipelines involves integrating various disciplines to enhance software delivery efficiency. Developers create modular codebases for seamless integration, while DevOps professionals automate build, test, and deployment processes to foster continuous improvement. Quality Assurance specialists design automated testing strategies to validate code quality, and System Administrators manage deployment environments using tools like Docker and Kubernetes to ensure consistency. Project Managers coordinate teams and align CI/CD initiatives with business objectives to ensure successful implementation. This interdisciplinary collaboration streamlines development, reduces manual intervention, and accelerates the delivery of high-quality software products.",
    "__EMPTY_5": "Dr.Gunjan Chandwani",
    "__EMPTY_6": "Ms.Roshi Saxena",
    "__EMPTY_7": "Mr.Shubham solanki",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CSE/ECE/MBA",
    "__EMPTY_10": "Research Paper",
    "__EMPTY_11": "This project contributes to SDG 9 (Industry, Innovation, and Infrastructure) by promoting automation and innovation in software delivery. It also supports SDG 8 (Decent Work and Economic Growth) by enhancing efficiency and reducing manual effort in development workflows.",
    "__EMPTY_12": "This project enhances software delivery speed and reliability through automation, benefiting the IT industry. It also contributes to knowledge by demonstrating practical CI/CD implementation and DevOps best practices"
  },
  {
    "__EMPTY": 23,
    "__EMPTY_1": "Dr. Monika Garg",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "Moved to R&AI sheet"
  },
  {
    "__EMPTY": 24,
    "__EMPTY_1": "Mr. Narender Gautam",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "Automate hospital administrative tasks",
    "__EMPTY_4": "To develop a modular system that automates key non-clinical workflows in hospitals — reducing manual workload, improving efficiency, and enhancing the patient experience.",
    "__EMPTY_5": "Dr. Gunjan",
    "__EMPTY_6": "Mr. Kapil Gupta\r\nAccenture, Gurgaon",
    "__EMPTY_7": "Mr. Sannskar Gupta\r\nCoforge",
    "__EMPTY_8": "Dr. Animesh",
    "__EMPTY_9": "CSE, Mgmt.",
    "__EMPTY_10": "Research Paper/ Prototype",
    "__EMPTY_11": "SDG 3",
    "__EMPTY_12": "Faster registration, billing, and discharge reduce waiting times and stress for patients and families."
  },
  {
    "__EMPTY": 25,
    "__EMPTY_1": "Dr. Neelu Chaudhary",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "IoT driven Innovations for Solid Waste Management in Smart Cities.",
    "__EMPTY_4": "The ever-growing population density in cities leads to a significant rise in waste generation. Insufficient infrastructure available for collection, transportation, treatment and disposal of waste, lack of planning, financial resources, technical deficiencies, lack of legislation and their implementation on real stage, and non-involvement of the masses are the main factors for the prevailing adverse situation. This project includes an elaborate study of the current waste management practices being followed across the globe explaining their design specifications and applicability features. Also, this study explores the incorporation of Internet of Things (IoT) technologies with waste management for the development of smart cities.",
    "__EMPTY_5": "Ms. Jyoti Nanwal",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_9": "CST",
    "__EMPTY_10": "Research Paper"
  },
  {
    "__EMPTY": 26,
    "__EMPTY_1": "Dr. Nitika Munjal",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "Effect of Different nano materials on solar cell efficiency ",
    "__EMPTY_4": "Improving the efficiency of solar cells is a major challenge in the renewable energy sector. Organic and thin-film solar cells offer sustainable alternatives to traditional silicon-based cells, but their performance is often limited by poor charge transport and recombination losses. The integration of nanomaterials (e.g., graphene, TiO₂ nanoparticles, ZnO nanorods, quantum dots) into various layers of solar cells has emerged as a promising solution to enhance optical absorption, charge separation, and transport.\r\n\r\nThis study proposes to simulate the incorporation of different nanomaterials into solar cell architectures using SCAPS-1D, a numerical modeling tool for analyzing the electrical performance of semiconductor devices. By systematically analyzing the effect of nanomaterials on key parameters such as open-circuit voltage (Voc), short-circuit current (Jsc), fill factor (FF), and power conversion efficiency (PCE), this project aims to optimize material choices for enhanced solar performance.",
    "__EMPTY_5": "Dr. Shiv Kumar Dixit, Dr. Anshuman",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. Monika Tomar, Univ. of Delhi",
    "__EMPTY_9": "CST, Physics",
    "__EMPTY_10": "Research paper",
    "__EMPTY_11": "SDG 7"
  },
  {
    "__EMPTY": 27,
    "__EMPTY_1": "Mr. Ram Chatterjee",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "To develop an AI-powered chatbot that complies with healthcare liability regulations and offers users preliminary medical advice and triage guidance. Ensure that the chatbot operates within legal boundaries by explicitly stating that it is not a substitute for professional medical consultation.",
    "__EMPTY_4": "This issue integrates the legal regulations regarding healthcare advice, liability, and user protection (from Law) with the technical development of an AI chatbot (from CSE).  Although AI facilitates real-time, accessible assistance for users, it must be meticulously designed to prevent legal liabilities, including unauthorized medical practice, misinformation liability, and noncompliance with informed consent standards.  The system is legally compliant and functionally beneficial as a result of the collaboration between technologists and legal experts.",
    "__EMPTY_5": "Dr. Sujata Nayak",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CST, Law",
    "__EMPTY_10": "Research Paper",
    "__EMPTY_11": "SDG9",
    "__EMPTY_12": "The project will significantly enhance public access to preliminary medical guidance, especially in underserved or remote areas. By providing structured triage support and symptom analysis, the chatbot can assist users in making timely decisions about seeking medical care, thereby reducing unnecessary clinical visits and easing the burden on healthcare systems. For the industry, it offers a scalable, legally compliant model for integrating AI into digital health services. Academically, it contributes to the evolving body of knowledge in ethical and responsible AI deployment in healthcare, particularly in designing AI systems that balance utility, legal compliance, and user trust.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nAsk ChatGPT\r\n"
  },
  {
    "__EMPTY": 28,
    "__EMPTY_1": "Dr. Ranjna Jain",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "AI-Powered Student Assistance Chatbot for Universities",
    "__EMPTY_4": "Design and implement an AI-powered chatbot specifically tailored to assist students by providing accurate and timely responses to queries related to university rules and regulations. The chatbot will act as a virtual assistant, accessible 24/7, helping students understand and navigate important guidelines on academic policies, examination rules, attendance requirements, code of conduct, disciplinary procedures, hostel regulations, and other institutional policies.",
    "__EMPTY_5": "Dr. Ranjna Jain",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. Girija Srikanth",
    "__EMPTY_9": "CST, SoE",
    "__EMPTY_10": "Protoype",
    "__EMPTY_11": "SDG9",
    "__EMPTY_12": "An AI chatbot offering 24/7 support, enhancing student awareness and compliance with university rules, regulations, and academic policies."
  },
  {
    "__EMPTY": 29,
    "__EMPTY_1": "Dr. Sanjay Singh",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "Sustainable Datacenters: A systematic approach for making energy efficient Datacenters",
    "__EMPTY_4": "Problem: A large hyperscale data center can emit 100,000 to 200,000 metric tons of CO₂ equivalent per year, depending on energy source and efficiency.\r\n\r\nSolution: Making the datacenters sustainable using energy aware techniques like renewable source of energy, Power aware techniques or Thermal aware techniques. Lots of work required for Energy efficent techniques at software level, Hardware level & Network level. (Relevent for: Electronics, Mechanical, Electrical)",
    "__EMPTY_5": "Anu Priya Sharma",
    "__EMPTY_6": "Mr Gaurav Saini",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr. Gagangeet Singh Aujala",
    "__EMPTY_9": "Mechanical, Electrical",
    "__EMPTY_10": "Prototype/Research paper",
    "__EMPTY_11": "SDG9, SDG13",
    "__EMPTY_12": "This project is expected to have a significant impact on both the IT industry and climate change by promoting responsible energy consumption in data centers."
  },
  {
    "__EMPTY": 30,
    "__EMPTY_1": "Dr. Shalu ",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "AI-Powered Waste Management System",
    "__EMPTY_4": "Problem: Inefficient and Manual Waste Management Systems\r\n\r\nTraditional waste management practices often suffer from inefficiencies such as irregular garbage collection, overflowing bins, lack of segregation at the source, and insufficient data for decision-making. These problems lead to unhygienic environments, increased operational costs, and missed sustainability goals. Manual monitoring of waste levels, routes, and recycling efforts is time-consuming, error-prone, and lacks real-time responsiveness.",
    "__EMPTY_5": "Dr. Bhawna Singla",
    "__EMPTY_6": "Dr. Praveen Varshney",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CSE & ECE",
    "__EMPTY_10": "Paper and patent",
    "__EMPTY_11": "SDG 11 – Sustainable Cities and Communities\r\nSDG 12 – Responsible Consumption and Production\r\nSDG 13 – Climate Action\r\nSDG 9 – Industry, Innovation, and Infrastructure\r\nSDG 3 – Good Health and Well-being",
    "__EMPTY_12": "Improved Urban Cleanliness and Health:\r\nBy automating waste segregation and optimizing collection routes using AI, the system reduces littering, overflowing bins, and waste-related diseases, improving public hygiene and overall urban health.\r\n\r\nEfficiency in Municipal Services:\r\nSmart scheduling and AI-driven logistics improve operational efficiency for waste collection services, saving time, fuel, and manpower."
  },
  {
    "__EMPTY": 31,
    "__EMPTY_1": "Ms. Tamanna Sachdeva",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "Secure Smart Home System for Blind People",
    "__EMPTY_4": "Create a smart home automation system tailored for visually impaired users, integrating voice-based control, AI-enabled environment feedback, and secure access features to enhance safety, independence, and ease of use.",
    "__EMPTY_5": "Ms. Esha Khanna",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CSE, R& AI, ECE",
    "__EMPTY_10": "Paper and patent",
    "__EMPTY_11": "SDG 3: Good Health and Well-being\r\nSDG 9: Industry, Innovation, and Infrastructure \r\nSDG 10: Reduced Inequalities \r\nSDG 11: Sustainable Cities and Communities ",
    "__EMPTY_12": "The system empowers visually impaired individuals with safety, independence, and dignity, while fostering inclusive design and opening new opportunities in smart home and assistive tech industries.\r\nIt advances knowledge by applying AI and IoT for accessibility, exploring voice interfaces, secure authentication, and setting a framework for future inclusive innovations."
  },
  {
    "__EMPTY": 32,
    "__EMPTY_1": "Dr. Urmila Pilania",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": "Automated Detection and Classification of Diabetic Retinopathy using Advanced Computational Techniques",
    "__EMPTY_4": "1. Helps in developing imaging devices and integrating automated systems with existing medical hardware.\r\n2. Involves the application of engineering principles to design and implement diagnostic tools compatible with clinical systems",
    "__EMPTY_5": "Dr. Manoj Kumar",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CSE",
    "__EMPTY_10": "Paper and patent and App",
    "__EMPTY_11": "SDG 3: Good Health and Well-being\r\nSDG 9: Industry, Innovation, and Infrastructure \r\n",
    "__EMPTY_12": "1. Development of a reliable automated system capable of identifying early signs of diabetic retinopathy (DR) from retinal images with high accuracy, sensitivity, and specificity.\r\n2. Effective categorization of diabetic retinopathy into various stages (e.g., mild, moderate, severe, proliferative) to support timely clinical intervention.\r\n3. Automation will significantly reduce the time and resources needed for manual screening, especially in rural and resource-limited settings."
  },
  {
    "__EMPTY": 33,
    "__EMPTY_1": "Dr. Arnika",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_4": "Involves the application of engineering principles to design and implement diagnostic tools compatible with clinical systems"
  },
  {
    "__EMPTY": 34,
    "__EMPTY_1": "Ms. Pooja Ahuja",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "AI ENABLED INVIGILATION SYSTEM",
    "__EMPTY_4": "BUILD AN REAL TIME DETECTION WHERE CHEATING ATTEMPTS ARE IMMEDIATELY FLAGGED ,BASED ON FACE RECOGNITION ATTENDANCE MARKING AS PER SEATING PLAN,SIX CLEARLY VISIBLE ALERTS AND VOICE ALERTS TO THE CANDIDATE.",
    "__EMPTY_5": "Dr. Pushpa",
    "__EMPTY_6": "Mr Ravikant from xebia",
    "__EMPTY_7": "Mr Vishal Vishwakarma(SIbros)",
    "__EMPTY_8": "NA",
    "__EMPTY_9": "CSE,ECE",
    "__EMPTY_10": "Patent and App",
    "__EMPTY_11": "SDG9:Industry ,Innovation and infrastructure",
    "__EMPTY_12": "This AI-enabled survillance system offers high utility by ensuring fair ,Secure and efficient monitoring acrodd exams,hotels ,offices and public areas."
  },
  {
    "__EMPTY": 35,
    "__EMPTY_1": "Ms. Ashima Garg",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "AI enabled Image caption generator",
    "__EMPTY_4": "Automatically generate meaningful captions that combines computer vision and natural language processing.\r\nA hardware device (like smart glasses or a wearable camera) can be used to capture scenes and read out \r\nreal-time image captions."
  },
  {
    "__EMPTY": 36,
    "__EMPTY_1": "Dr. Awwab Mohammad",
    "__EMPTY_2": "Asstt. Prof.\r\n\r\nMoved to R&AI sheet",
    "__EMPTY_3": "Automatically generating meaningful captions for images is a challenging task that combines computer vision and natural language processing.",
    "__EMPTY_4": "Urban waste management remains a persistent challenge due to inefficiencies in waste categorization, collection logistics, and environmental impact monitoring. This project seeks to address this issue by designing an AI-driven smart waste management system that integrates computer vision, IoT technologies, environmental sustainability principles, and economic feasibility models. This is inherently an interdisciplinary problem, requiring collaboration across:\r\n\r\nComputer Science: to develop machine learning models for real-time waste classification and predictive analytics for collection route optimization.\r\nElectronics/IoT: to design and deploy sensor networks for tracking bin fill levels and environmental conditions (e.g., temperature, odor, gas emissions).\r\nEnvironmental Science: to guide the system design towards environmentally sustainable practices and compliance with urban waste disposal regulations.\r\nBusiness/Management: to analyze operational viability, cost-benefit structures, and propose models for municipal partnerships and smart city integration."
  },
  {
    "__EMPTY": 37,
    "__EMPTY_1": "Dr. Ganga Sharma",
    "__EMPTY_2": "Assoc. Prof.",
    "__EMPTY_3": " AI assisted skin disease detection and classification app",
    "__EMPTY_4": "This system will provide real time assistance to end user to detect and classify skin diseases. The app can be web based or mobile based. This will help in early diagnosis and prognosis of skin diseases including skin cancer.",
    "__EMPTY_5": "Ms Babita Yadav, Assistant Professor, CST",
    "__EMPTY_6": "Mr Ashvin, ADP (Automatic Data Processing ), The Square, Nagar Rd, opp. CTR Factory, Kargil Vijay Nagar, Wadgaon Sheri, Pune, Maharashtra 411014",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr Shilpy Agrawal, Professor, Galgotias University, Greater Noida",
    "__EMPTY_9": "CST, Sciences",
    "__EMPTY_10": "Research Paper, Patent, Prototype",
    "__EMPTY_11": "SDG3: Health and well being",
    "__EMPTY_12": "The system will serve as expert as well as end-user oriented application. A user will be able to determine the type, condition, causes and symptoms of a skin disease at click of a button. "
  },
  {
    "__EMPTY": 38,
    "__EMPTY_1": "Ms. Babita Yadav",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "Developing  AI based system to Support Mental Health",
    "__EMPTY_4": "Develop a system to enhance mental well-being by automatically sensing a user's emotional state (like stress or focus) using non-invasive physiological and behavioral sensors, analyzing this data with machine learning, and providing appropriate feedback or interventions.",
    "__EMPTY_5": "Dr KDEEPA",
    "__EMPTY_6": "Saurabh Lohiya , CEO, Lark Finserve",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Dr Sachin Gupta ,MAIT DELHI",
    "__EMPTY_9": "CST,ECE,Medical Sciences",
    "__EMPTY_10": "Research Paper, Patent, Prototype",
    "__EMPTY_11": "SDG3: Health and well being",
    "__EMPTY_12": "This project promotes early detection and personalized support for mental well-being using non-invasive sensing and AI."
  },
  {
    "__EMPTY": 39,
    "__EMPTY_1": "Dr.Aditi Chaudhary\r\nMoved to sheet of School of Law",
    "__EMPTY_2": "Asstt. Prof.",
    "__EMPTY_3": "Industrial Development in Faridabad: Environmental challenges and risks ",
    "__EMPTY_4": "Assess the small scale industries in Faridabad and if they are adopting  sustainable practices "
  }
]