[
  {
    "__EMPTY_5": "At least 1 out of Industry mentor or Alumni Mentor or Faculty Co-Mentor from outside MRU is required."
  },
  {
    "SCHOOL OF LAW": "Sl. No.",
    "__EMPTY": "Name of Faculty",
    "__EMPTY_1": "Designation",
    "__EMPTY_2": "Problem Statement",
    "__EMPTY_3": "IDPaspectInproblemStatement",
    "__EMPTY_4": "facultyComentorFromMRU",
    "__EMPTY_5": "industryMentor",
    "__EMPTY_6": "alumniMentor",
    "__EMPTY_7": "facultyComentorOutsideMRU",
    "__EMPTY_8": "DisciplinesInvovled",
    "__EMPTY_9": "ExpectedOutcome",
    "__EMPTY_10": "SDGs",
    "__EMPTY_11": "societalOrIndustrialImpact"
  },
  {
    "SCHOOL OF LAW": 1,
    "__EMPTY": "Prof. (Dr.) Asha Verma",
    "__EMPTY_1": "Professor, Dean-Law",
    "__EMPTY_2": "Legal and Technological Frameworks for Sustainable Urban Development: An Interdisciplinary Approach to Smart and Green Cities",
    "__EMPTY_3": "Law: Analysis of national and international environmental laws, urban planning regulations and legal enforcement mechanisms. Engineering: Evaluation of green infrastructure, waste management technologies, renewable energy solutions and sustainable building design. Humanities: Study of environmental ethics, public awareness, social impact assessments and behavioral change strategies. Management: Project planning, green finance, CSR practices, sustainability reporting and stakeholder engagement.",
    "__EMPTY_4": "Dr Apala Vatsa",
    "__EMPTY_5": "Advocate Prerna Arora",
    "__EMPTY_6": "Ms Sanjoli Sharma",
    "__EMPTY_7": "Prof. (Dr) Anurag deep",
    "__EMPTY_8": "Law, Management, Humanities",
    "__EMPTY_9": "Research paper, Copyright,",
    "__EMPTY_10": "SDG 11: Sustainable Cities and Communities – Primary impact through legal and tech-based urban planning. SDG 9: Industry, Innovation, and Infrastructure – Supports smart, resilient infrastructure.  SDG 13: Climate Action – Promotes climate-resilient urban policies and green technologies.  SDG 7: Affordable and Clean Energy – Encourages clean energy integration in urban areas.  SDG 6: Clean Water and Sanitation – Enhances water management through smart systems.  SDG 16: Peace, Justice, and Strong Institutions – Strengthens legal and governance frameworks.  SDG 17: Partnerships for the Goals – Fosters interdisciplinary and public-private collaboration.",
    "__EMPTY_11": "The project is expected to contribute significantly to new knowledge by addressing existing gaps in [insert subject area]. It will aid policymakers, professionals, and scholars with evidence-based insights and practical recommendations. The societal impact includes raising awareness, promoting justice, and empowering stakeholders, while the industry/professional impact involves strengthening practices, policy reforms, and capacity building in the relevant field."
  },
  {
    "SCHOOL OF LAW": 2,
    "__EMPTY": "Dr. Shaharyar Asaf Khan",
    "__EMPTY_1": "Assoc. Dean-Academics Appl. Sc., Edu & Law"
  },
  {
    "SCHOOL OF LAW": 3,
    "__EMPTY": "Prof. (Dr.) Ruchi Lal",
    "__EMPTY_1": "Prof., HoD-Law",
    "__EMPTY_2": "Business and Human Rights: An Interdisciplinary Study on Corporate Responsibility, Legal Compliance and Ethical Practices",
    "__EMPTY_3": "It will explore the intersection of human rights and corporate behavior, focusing on how businesses uphold human rights standards within global operations. It examines legal frameworks, ethical implications and management strategies for ensuring responsible business conduct. The project brings together perspectives from law, management, and humanities to analyze case studies and propose sustainable, rights-based business models.",
    "__EMPTY_4": "Dr Superna",
    "__EMPTY_5": "Advocate Chayan Sarkar",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA"
  },
  {
    "SCHOOL OF LAW": 4,
    "__EMPTY": "Prof. (Dr.) S. K. Bose",
    "__EMPTY_1": "Professor"
  },
  {
    "SCHOOL OF LAW": 5,
    "__EMPTY": "Dr. Superna Venaik",
    "__EMPTY_1": "Associate Professor",
    "__EMPTY_2": "Pollution Control and Environmental Justice: Legal Frameworks, Corporate Accountability and Societal Impact",
    "__EMPTY_3": "Law, Management and Humanities domain. This project will examine how environmental laws regulate various forms of pollution, while also examining corporate accountability and the socio-cultural impact of environmental degradation. It adopts legal, managerial, and humanistic perspectives to propose effective and inclusive solutions for achieving environmental justice.",
    "__EMPTY_4": "Dr. Ruchi Lal",
    "__EMPTY_5": "Advocate Sangam Singh Kochhar",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Anubha Srivastava, Assistant Professor, School of Law, Christ University, Bangalore",
    "__EMPTY_8": "Law, Environment, Justice",
    "__EMPTY_9": "Research Paper; Blogs",
    "__EMPTY_10": "SDG 8- Decent Work & Economic Growth; SDG 12- Responsible Consumption & Production; SDG 16- Peace, Justice & Strong Institutions; SDG 17- Partnerships for the Goals",
    "__EMPTY_11": "The research will enrich scholarly understanding of environmental law, corporate responsibility and socio-cultural dynamics of environmental harm."
  },
  {
    "SCHOOL OF LAW": 6,
    "__EMPTY": "Dr. Chhavi Kulshretha ",
    "__EMPTY_1": "Associate Professor",
    "__EMPTY_2": "Narratives of Nature:Exploring the Role of Literature in Environmental Awareness and Sustainable Thinking",
    "__EMPTY_3": " Literary works of all genres have long criticized environmental exploitation, portrayed peaceful, sustainable futures, and mirrored human interactions with nature. The goal of this project is to investigate how literary depictions of nature raise environmental consciousness and encourage sustainable thinking. ",
    "__EMPTY_4": "Ms. Ushita Banerjee, Assistant Professor, SoEH, MRU",
    "__EMPTY_5": "Mr. Prabhakar Patel",
    "__EMPTY_6": "Ms. Shreya Mishra",
    "__EMPTY_7": "Dr. Anurag Joshi, Professor, Indore",
    "__EMPTY_8": "Environment Science, Education/English Literature",
    "__EMPTY_9": "Research Paper; VLogBlogs;Newspaper Article",
    "__EMPTY_10": "SDG3-Good helath and Well -Being; SDG13-Climate Action; SDG15-Life on Land"
  },
  {
    "SCHOOL OF LAW": 7,
    "__EMPTY": "Dr. Tarundeep Kaur",
    "__EMPTY_1": "Associate Professor",
    "__EMPTY_2": "Law and Sociology:  An Interdisciplinary study on Law and Society",
    "__EMPTY_3": "In modern societies, legal systems are designed to uphold justice and maintain social order. However, disparities in legal outcomes across different social groups raise concerns about the equitable application of the law. Sociological research indicates that factors such as socioeconomic status, race, and community norms can influence both the creation and enforcement of laws. This intersection between legal frameworks and social structures necessitates an in-depth examination of how societal norms and inequalities impact legal processes and outcomes. Understanding these dynamics is crucial for developing a legal system that is both fair and reflective of the diverse society it serves.​",
    "__EMPTY_4": "Dr. Chhavi Kulshreshta",
    "__EMPTY_6": "Ms. Saumya Sharma",
    "__EMPTY_8": "Sociology",
    "__EMPTY_9": "Research Papers, Case studies",
    "__EMPTY_10": "he research will include a discussion of indigenous peoples' lifestyles and how they have managed to preserve their social environment by adopting sustainable lifestyles."
  },
  {
    "SCHOOL OF LAW": 8,
    "__EMPTY": "Dr. Manisha Narula",
    "__EMPTY_1": "Associate Professor",
    "__EMPTY_2": "\"Living Heritage :The Role of Traditional Knowledge of Indigenous People in Conservation of Biodiversity\"",
    "__EMPTY_3": "Indigenous people have a sacred relationship with forest lands. Indigenous people with a historical continuity of resource-use practices often possess a broad knowledge base of the behavior of complex ecological systems in their own localities. Where indigenous people have depended, for long periods of time, on local environments for the provision of a variety of resources, they have developed a stake in conserving, and in some cases, enhancing biodiversity.The research aims to study the role that indigenous people can play in protection of eroding Environment.",
    "__EMPTY_4": "Dr. Yamini Atreya",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Vanita Khanna, Assistant Professor, GNDU Regional Centre, Jalandhar",
    "__EMPTY_8": "Law, Environment and Sociology",
    "__EMPTY_9": "Research Paper, Copyright",
    "__EMPTY_10": "3,9,13,16",
    "__EMPTY_11": "The Research will be a discussion on the ways of life of indigenous people and how they have maneged to save the enviornment around them through the sustainable ways of living."
  },
  {
    "SCHOOL OF LAW": 9,
    "__EMPTY": "Dr. Ghazala Abidin",
    "__EMPTY_1": "Associate Professor",
    "__EMPTY_2": "Autism Spectrum Disorder in Children: An Empirical Study Addressing the Educational Challenges and Human Rights Violation in India",
    "__EMPTY_3": "Autism Spectrum Disorder (ASD) is a complex neurodevelopmental condition that affects communication, behavior, and social interaction. In India, children with ASD often face significant educational challenges due to the lack of inclusive infrastructure, inadequate teacher training, and limited awareness. These educational barriers not only hinder academic development but also result in the systemic denial of fundamental human rights, including the right to education, equality, and dignity. This research adopts an interdisciplinary approach, integrating education, law, public policy, psychology, and human rights studies to comprehensively examine the lived realities of children with ASD. ",
    "__EMPTY_4": "Mr. Sharv Dutt Anand",
    "__EMPTY_5": "Ms. Amandeep Kaur",
    "__EMPTY_6": "Payal Taver",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Education",
    "__EMPTY_9": "Research Paper; Newspaper article, Vlog/Blog",
    "__EMPTY_10": "6, 11, 13, 14,15",
    "__EMPTY_11": "The study is expected to raise awareness about the educational challenges faced by children with Autism Spectrum Disorder (ASD) in India. It will help identify and document instances of human rights violations in educational settings. The research aims to inform policymakers to strengthen inclusive education policies under the Rights of Persons with Disabilities Act, 2016. It will support the development of specialized teacher training and autism-friendly teaching strategies. The study will fill critical empirical gaps by providing India-specific data on ASD and education. It will contribute to reducing social stigma and promoting acceptance of children with ASD. Overall, the research will generate actionable recommendations to improve educational access and uphold the dignity of children with ASD."
  },
  {
    "SCHOOL OF LAW": 10
  },
  {
    "SCHOOL OF LAW": 11,
    "__EMPTY": "Dr. Arushi Malik",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "An Interdisciplinary Analysis of Corporate Social Responsibility: Exploring its Impact, Ethical Dimensions, and Sustainable Practices",
    "__EMPTY_3": "The project will not only explore the legal angle with respect to Corporate Social Responsibility but also the economic implications of CSR and analyse the strategies of integrating CSR into core business strategy for long term value creation. It will also explore how CSR can align with the SDGs. ",
    "__EMPTY_4": "Ms. Surabhi",
    "__EMPTY_5": "Advocate Anant Vijay Maria, AOR Supreme Court",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Vidushi Puri, Assistant Professor Amity University Gurugram",
    "__EMPTY_8": "SoMC",
    "__EMPTY_9": "Research paper, newspaper article",
    "__EMPTY_10": "SDG 7, 9 and 13",
    "__EMPTY_11": "Exploring the alignment of CSR with SDG's for the Industry"
  },
  {
    "SCHOOL OF LAW": 12,
    "__EMPTY": "Ms. Asmita Patel",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "Digital Mediation Platforms and Access to Justice: An Interdisciplinary Study of Technology-Driven ADR Mechanisms in India",
    "__EMPTY_3": "While Alternative Dispute Resolution (ADR) mechanisms aim to provide quick and affordable justice, their effectiveness in the digital era remains underexplored. This project seeks to examine how technology—particularly digital mediation platforms—can enhance or hinder access to justice, especially for marginalized communities, combining insights from law, technology, and sociology.",
    "__EMPTY_4": "Ms. Garima Pahwa",
    "__EMPTY_5": "Mr. Sidhant Kaushik, Principal Associate, DSK Legal",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "CST"
  },
  {
    "SCHOOL OF LAW": 13,
    "__EMPTY": "Ms. Chaitali Wadhwa",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "Gender Discrimination and AI",
    "__EMPTY_3": "This project explores the intersection of Gender Discrimination and Artificial Intelligence, analyzing how AI technologies can both challenge and reinforce gender biases. It investigates the use of AI tools to detect and prevent discriminatory practices, particularly in hiring, content moderation, and workplace dynamics. At the same time, it critically examines how biased datasets and algorithmic design may unintentionally perpetuate gender stereotypes.",
    "__EMPTY_5": "Ms. Khyati Goel\r\nSenior Associate, Khaitan & Co.",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "CST",
    "__EMPTY_9": "Research Paper",
    "__EMPTY_10": "SDG5"
  },
  {
    "SCHOOL OF LAW": 14,
    "__EMPTY": "Ms. Nidhi",
    "__EMPTY_1": "Assistant Professor"
  },
  {
    "SCHOOL OF LAW": 15,
    "__EMPTY": "Ms. Sampriti Phukan",
    "__EMPTY_1": "Assistant Professor"
  },
  {
    "SCHOOL OF LAW": 16,
    "__EMPTY": "Ms. Simran Singh",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "Reimagining Trademark Law for the Virtual Economy: A Legal Framework for NFTs, Metaverse and Virtual Goods.",
    "__EMPTY_3": "\r\nThis will focus on- Indian IP laws don't cover virtual assets, avatars, or trademark use in gaming/metaverse. Comparative study (EUIPO, USPTO); proposed reforms to Indian TM Rules; class extension under NICE Classification",
    "__EMPTY_4": "Dr. Yamini",
    "__EMPTY_5": "Adv. Sumit Nagpal",
    "__EMPTY_6": "Saumya",
    "__EMPTY_7": "Dr. Manisha Narula",
    "__EMPTY_8": "SoE",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG 8 & 9",
    "__EMPTY_11": "This research aims to modernize Indian trademark law to address the emerging challenges of virtual goods, NFTs, and the metaverse. By proposing legal reforms and aligning with global best practices, it contributes to building a robust IP framework that supports innovation, protects digital brands, and fosters trust in the virtual economy. The study is expected to benefit businesses, creators, and policymakers, while also promoting digital growth in line with sustainable development goals.\r\n"
  },
  {
    "SCHOOL OF LAW": 17,
    "__EMPTY": "Ms. Vani Kataria",
    "__EMPTY_1": "Res. Assoc.",
    "__EMPTY_2": "Purpose beyond profit: rethinking CSR across disciplines",
    "__EMPTY_3": "The project will explores the evolving landscape of Corporate Social Responsibility through an interdisciplinary lens—combining law, business, sociology, and environmental studies. It aims to analyze how corporations are moving beyond traditional CSR to embrace long-term social impact initiatives. The research will focus on legal frameworks, ethical considerations, sustainable business models, and the societal outcomes of CSR programs. The project will include case studies, stakeholder interviews from Delhi NCR, and propose innovative strategies for companies to align.",
    "__EMPTY_4": "Dr. Manisha ",
    "__EMPTY_5": "Corporates",
    "__EMPTY_6": "Shruti Kumari",
    "__EMPTY_7": "Navna",
    "__EMPTY_8": "SOL, SoMC",
    "__EMPTY_9": "Research Paper",
    "__EMPTY_10": "SDG 16",
    "__EMPTY_11": "understanding Role of MNCs for society "
  },
  {
    "SCHOOL OF LAW": 18,
    "__EMPTY": "Dr. Yamini Atreya",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "“The Secret Recipe : \r\nTrade Secrets in the Food & Beverage Industry”",
    "__EMPTY_3": "In the rapidly growing food and beverage (F&B) industry, uniqueness and innovation often lie in recipes, preparation methods, ingredient mixes, and branding strategies. Many successful food ventures rely not on patents (which require disclosure), but on trade secrets to protect their distinctiveness and market edge.\r\nHowever, India lacks a dedicated Trade Secret law, relying instead on contract law, tort law, and judicial precedents. This leaves businesses, especially small cafés, local eateries, home chefs, and cloud kitchens, vulnerable to theft, misuse, or leakage of confidential recipes or business strategies — often by former employees or partners.Despite being the heart of many successful culinary ventures, trade secrets are often poorly understood and weakly protected, especially in India's informal and semi-formal food sector.\r\nThere is a lack of legal awareness, proper documentation (NDAs, confidentiality clauses), and strategic implementation of trade secret protection among small and medium food businesses.",
    "__EMPTY_4": "Simran ",
    "__EMPTY_5": "Cafe Owners - Mokaaz Case, Cafe Saga, Tapri, Maverick.",
    "__EMPTY_6": "Neha Gupta",
    "__EMPTY_7": "Shivang Tripathi ",
    "__EMPTY_8": "SoMC",
    "__EMPTY_9": "Research Paper ",
    "__EMPTY_10": "SDG 9",
    "__EMPTY_11": "will identify the loop holes for research purposes "
  },
  {
    "SCHOOL OF LAW": 19,
    "__EMPTY": "Dr. Aaratrika Pandey",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "Gender studies and Law",
    "__EMPTY_3": "This project will critically examines the legal and ethical dimensions of menstruation leave policies. While some legal systems have begun to recognize menstrual leave, many others lack clarity or outright reject it, reflecting deep-rooted gender biases. By integrating feminist theory and philosophical notions of equality and bodily autonomy, this study explores whether and how legal recognition of menstruation leave can advance gender justice in the workplace.",
    "__EMPTY_5": "Mr. Saquib, Advocate, Allahabad High Court",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Anjali",
    "__EMPTY_8": "SoL",
    "__EMPTY_9": "Research Paper"
  },
  {
    "SCHOOL OF LAW": 20,
    "__EMPTY": "Ms. Surabhi Sharma",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "Interdisciplinary Examination of the Insolvency and Bankruptcy Code: Legal, Economic, and Financial Perspectives",
    "__EMPTY_3": "This interdisciplinary project will examine the impact, challenges, and potential improvements of the IBC from three key perspectives: legal, economic, and financial. The project will evaluate the efficacy of the IBC in achieving its objectives and propose enhancements to make it more effective in addressing corporate insolvencies in India.",
    "__EMPTY_4": "Dr. Arushi",
    "__EMPTY_5": "Ms. Prerna Gupta, AOR, Supreme Court",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Ms. Garima Yadav, Assistant Professor",
    "__EMPTY_8": "SoMC",
    "__EMPTY_9": "Respearch Paper",
    "__EMPTY_10": "SDG8",
    "__EMPTY_11": "Will identify the effectiveness of the legal policy which plays a crucial role in our economy. "
  },
  {
    "SCHOOL OF LAW": 21,
    "__EMPTY": "Ms. Garima Pahwa",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "AI AND ROBOTICS IN LEGAL PROCEEDINGS: Algorithm and Machine Learning ",
    "__EMPTY_3": "This research will be interdisplinary as it is integration of law, computer science and robotics engineering. The idea behind this research to make an algorithm which will act as robotic lawyer and judge as seen in China and USA.  ",
    "__EMPTY_5": "Dr. Parikshit Sirohi",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Medha Tiwari",
    "__EMPTY_8": "SOE, SOL",
    "__EMPTY_9": "Patent/ Research Paper",
    "__EMPTY_10": "SDG9",
    "__EMPTY_11": "Will bring AI and Robotics in Legal Faternity"
  },
  {
    "SCHOOL OF LAW": 22,
    "__EMPTY": "Dr.Apala Vatsa",
    "__EMPTY_1": "Associate Professor",
    "__EMPTY_2": "Law, Power and the State",
    "__EMPTY_3": "1. Investigate how legal systems uphold, legitimize or challenge political authority; 2. Case studies could include authoritarian regimes, legal repression and emergency laws  ",
    "__EMPTY_4": "Aditya verma",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Aratrika Deb",
    "__EMPTY_8": "Law and Political science",
    "__EMPTY_9": "research paper",
    "__EMPTY_10": "SDG 16",
    "__EMPTY_11": " Investigate how legal systems uphold, legitimize or challenge political authority"
  },
  {
    "SCHOOL OF LAW": 23,
    "__EMPTY": "Dr.Harshita Singh",
    "__EMPTY_1": "Associate Professor",
    "__EMPTY_2": "Neurotechnology and Indian Law: Navigation Legal Frontiers",
    "__EMPTY_3": "The rapid advancement of neurotechnology introduced new possibilities for criminal rehabilitation and cognitive enhancement. Neurotechnology such as Brain Computer Interfaces (BCI) and neuro imaging can provide valuable insights into criminal behaviour. Strong legal frame work  balances technological advancements with ethical and constitutional safeguards. The increasing reliance on digital and AI-based solution in the legal landscape, neurotechnology introduces novel  challenges that demands urgent legal scrutiny. The study highlights how neurotechnological developments can reshape criminal justice procedures and legal accountability.",
    "__EMPTY_4": "Dr. Superna Venaik",
    "__EMPTY_5": "Adv. Gajendra Singh, Meerut Court,",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Tarun Pratap, Asst. Prof. GLA Univ. Mathura & Dr. Myunghoon Roh, Asst. Prof. Saive Regina Univ. US.",
    "__EMPTY_8": "Law, Science & Tech, Humanaties, Psychology",
    "__EMPTY_9": "Research Paper",
    "__EMPTY_10": "SDG-16",
    "__EMPTY_11": "neurotechnology has the capacity to revolutionize criminal justice by making rehabilitation more effective and humane, to enhance human capabilities, and to expand our scientific understanding of the brain. However, the magnitude of these impacts will depend on the development of a strong legal and ethical framework that balances innovation with the protection of fundamental rights"
  },
  {
    "SCHOOL OF LAW": 24,
    "__EMPTY": "Mr Aditya Verma",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "Constitutionalism and Democratic Theory ",
    "__EMPTY_3": "Examine the relationship between constitutional framework and democratic governance. Focuses on how constitutions constraint power, enable political participation and shape legitimacy. Topics include constitutional design, judicial review, populism vs. liberal constitutionalism, and the tension between majority rule and rights protection. ",
    "__EMPTY_4": "Apala Vatsa",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Aratrika Deb",
    "__EMPTY_8": "Law and Political science",
    "__EMPTY_9": "research paper",
    "__EMPTY_10": "SDG 16",
    "__EMPTY_11": " Investigate how legal systems uphold, legitimize or challenge political authority"
  },
  {
    "SCHOOL OF LAW": 25,
    "__EMPTY": "Mr Anupam Sharma",
    "__EMPTY_1": "Assistant Professor",
    "__EMPTY_2": "IP backed financing ",
    "__EMPTY_3": "Intellectual Property (IP)-backed financing presents a complex, multidisciplinary challenge. While IP is a key intangible asset for start-ups and SMEs, it remains underutilized in formal credit systems due to legal uncertainties, lack of valuation standards, and enforcement difficulties. Financial institutions are hesitant to accept IP as collateral, given its intangible and volatile nature. Entrepreneurs often lack awareness and institutional support to monetize IP. Simultaneously, rapid technological innovations are creating new IP forms that outpace existing legal and financial frameworks. Addressing this issue requires a collaborative approach across law, finance, business, and technology to enable IP as a credible financial asset.",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Waseem",
    "__EMPTY_8": "IPR",
    "__EMPTY_9": "Research Article",
    "__EMPTY_10": "SDG 9: Industry, Innovation, and Infrastructure",
    "__EMPTY_11": "A new form of funding can be created for MSME. "
  }
]