[
  {
    "__EMPTY_5": "At least 1 out of Industry mentor or Alumni Mentor or Faculty Co-Mentor from outside MRU is required."
  },
  {
    "PROGRAM MATHEMATICS:": "SR. No.",
    "__EMPTY": "Name of Faculty",
    "__EMPTY_1": "Designation",
    "__EMPTY_2": "Problem Statement",
    "__EMPTY_3": "IDPaspectInproblemStatement",
    "__EMPTY_4": "facultyComentorFromMRU",
    "__EMPTY_5": "industryMentor",
    "__EMPTY_6": "alumniMentor",
    "__EMPTY_7": "facultyComentorOutsideMRU",
    "__EMPTY_8": "DisciplinesInvovled",
    "__EMPTY_9": "ExpectedOutcome",
    "__EMPTY_10": "SDGs",
    "__EMPTY_11": "societalOrIndustrialImpact"
  },
  {
    "PROGRAM MATHEMATICS:": 1,
    "__EMPTY": "Dr. Aparna Vyas",
    "__EMPTY_1": "Assoc. Professor\r\nProgram Head-Maths",
    "__EMPTY_2": "Image Processing{enhancemeant,denoising} using Multiscale transform (Matlab,Paython Software )",
    "__EMPTY_3": "Image denoising plays very crucial role in applications which include photography/videography, Security-Surveillance, Medical Image analysis, Astronomy, Aerial photography, Satellite Imagery, and many more. The results of denoising also affect the accuracy of later tasks of image segmentation, object recognition, classification.\r\nIn this project we explore image denoising of different images with different noises using multiscale transform such as wavelet transform, ridgelet transform, curvelet transform and shearlet transform and several thresholding techniques such as hard thresholding, soft thresholding, SUREShrink, VisuShrink and BayesShrink etc. Further, we compare the performance of these methods or transform in terms of PSNR and MSE values and aim to provide better image denoising technique for images.",
    "__EMPTY_4": "Dr. Charu Pathak, ECE Dept.\r\n Dr. Manpreet Kaur, CST Dept.",
    "__EMPTY_5": "1. Prof. Joonki Paik\r\nDepartment of Image Science \r\nChung-Ang University\r\n\r\n2. Prof. Gibak Kim\r\nDepartment of Electrical Enginnering\r\nSoongsil University, Seoul, South Korea",
    "__EMPTY_6": "NA ",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "CST, ECE",
    "__EMPTY_9": "Research Paper",
    "__EMPTY_10": "SDG 3, 4, 9, 11, 13",
    "__EMPTY_11": "The outcome is expected to contribute:\r\n\r\nTo Industry: By improving visual data preprocessing pipelines in domains such as healthcare diagnostics, satellite image interpretation, and security surveillance, leading to more accurate and reliable decision-making.\r\n\r\nTo Society: Through enhanced image quality in daily applications such as mobile photography, video streaming, and medical diagnostics, ultimately improving user experience and diagnostic precision.\r\n\r\nTo New Knowledge: By offering comparative insights into the performance of different multiscale transforms and thresholding methods, the research contributes to the academic understanding and future development of efficient image denoising algorithms.\r\n\r\nIn general, this work promotes innovation in digital imaging and lays the groundwork for robust, noise-resilient image processing systems."
  },
  {
    "PROGRAM MATHEMATICS:": 2,
    "__EMPTY": "Prof. (Dr.) Deepa Arora",
    "__EMPTY_1": "Prof., Director-IQAC      ",
    "__EMPTY_2": "EduFlow: Optimizing Document Management and Workflow for Institutional Improvements",
    "__EMPTY_3": "Objective:\r\nTo create a centralized, efficient, and user-friendly system to optimize the management, review, approval, and storage of institutional documents, ensuring smooth workflows for internal processes like policy updates, accreditation, meeting minutes, and more. This project aims to streamline operations within educational institutions, particularly for departments like IQAC (Internal Quality Assurance Cell), and enhance document accessibility, security, and collaboration.\r\nThe project is interdisciplinary, combining Computer Science for backend development, cloud storage, and security protocols; Education Management for aligning workflows with institutional governance and accreditation standards; Human-Computer Interaction (HCI) for designing a user-friendly interface for diverse stakeholders; and Law and Compliance to ensure data privacy and audit trails. This integration of technical, educational, design, and legal aspects enhances document management efficiency and supports institutional quality assurance processes.",
    "__EMPTY_4": "Dr. Prashant Bhardwaj\r\nDr. Roopa Rani",
    "__EMPTY_5": "NA ",
    "__EMPTY_6": "NA ",
    "__EMPTY_7": "NA ",
    "__EMPTY_8": "CST",
    "__EMPTY_9": "Research paper, copyright",
    "__EMPTY_10": "SDG 4,9,16,17",
    "__EMPTY_11": "Impact on Society\r\nEduFlow promotes transparency and efficiency in educational institutions by streamlining documentation and workflows, leading to improved governance and better academic outcomes.\r\n\r\nImpact on Industry\r\n\r\nIt offers a scalable digital solution for the higher education sector, supporting regulatory compliance, reducing manual processes, and fostering sustainable, paperless operations.\r\n\r\nContribution to New Knowledge\r\n\r\nEduFlow integrates technology, education management, design, and legal compliance to create an interdisciplinary model that advances research in digital transformation and quality assurance in education.\r\n"
  },
  {
    "PROGRAM MATHEMATICS:": 3,
    "__EMPTY": "Dr. Advin Masih ",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Applications of Differential Geometry from Curved Spacetimes to Data Manifolds",
    "__EMPTY_3": "This project explores differential geometry concepts, specifically the curvature and topology of manifolds, to analyze structures arising in physics and data science. In physics, spacetime is modeled as a curved manifold in general relativity, while in data science, high-dimensional datasets often lie near lower-dimensional manifolds. The interdisciplinary focus lies in applying geometric tools to model physical phenomena and extract meaningful patterns from complex data.",
    "__EMPTY_4": "Prof. Sachin Lakra, \r\nProfessor- CST, MRU",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Mamta Thakur,",
    "__EMPTY_8": "CST, Maths",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG4, SDG13",
    "__EMPTY_11": "Differential geometry bridges theoretical physics and data science, shaping our understanding of spacetime and enabling manifold learning in AI. Its applications in robotics, neuroscience, and medical imaging drive innovation and precision. The field contributes to smarter technologies and deeper insights into natural phenomena. This fosters interdisciplinary research and societal advancement through geometry-driven knowledge."
  },
  {
    "PROGRAM MATHEMATICS:": 4,
    "__EMPTY": "Dr. Ankita Gaur",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Graph Theoretic Analysis of Social Media Networks",
    "__EMPTY_3": "This project is interdisciplinary as it applies mathematical graph theory and computational algorithms (from mathematics and computer science) to analyze the structure and dynamics of social media networks, while interpreting the results through the lens of social science to understand human behavior, influence, and community formation.\r\nSuch integration enables a comprehensive understanding of both the technical and social aspects of online platforms, supporting applications in areas like marketing, public health, and information dissemination.",
    "__EMPTY_4": "Prof. ( Dr. ) Mrinal Pandey",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "CST, Maths",
    "__EMPTY_9": "Research Paper",
    "__EMPTY_10": "SDG 3, SDG 4, SDG 9",
    "__EMPTY_11": "The expected impact of this interdisciplinary project is to give society and industry better ways to understand and predict how people connect, share, and influence each other on social media platforms. By applying graph theory and computer algorithms, the project will help improve marketing strategies, strengthen online communities, and provide new knowledge about digital human behavior, making online interactions safer and more effective for everyone."
  },
  {
    "PROGRAM MATHEMATICS:": 5,
    "__EMPTY": "Dr. Bhawna Singla",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Smart Predictions: Applied Machine Learning with Statistical Foundations",
    "__EMPTY_3": "This project is interdisciplinary as it appliesStatistics, Computer Science, and Engineering—to provide students with an approach to solve complex, real-world problems.                                                                The project aims to apply statistical analysis and machine learning techniques for solving real-world engineering problems by building predictive models, interpreting results with statistical rigor.",
    "__EMPTY_4": "Prof.(Dr.) Deepa Arora, Dr Shalu ",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "CST, Maths",
    "__EMPTY_9": "Research Paper",
    "__EMPTY_10": "SDG 3, SDG 4, SDG 9",
    "__EMPTY_11": "These project will  lead to increased efficiency, better resource allocation, and even improvements in public health and safety. However, this technology also presents challenges related to job displacement, bias, and ethical considerations, highlighting the need for careful consideration and responsible implementation, according to research and analysis of the societal impact of machine learning. "
  },
  {
    "PROGRAM MATHEMATICS:": 6,
    "__EMPTY": "Dr. Dinesh Tripathi",
    "__EMPTY_1": "Assoc. Prof.",
    "__EMPTY_2": "Climate Modeling with Polynomial Approximations",
    "__EMPTY_3": "This project integrates mathematics (polynomial approximation theory) with climate science to model and predict environmental variables. It bridges numerical methods and data analysis to provide simplified yet insightful representations of complex climate behavior.",
    "__EMPTY_4": "NA",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Chemistry, Maths",
    "__EMPTY_9": "Research paper ",
    "__EMPTY_10": "SDG 4, 9 & 13",
    "__EMPTY_11": "This project is expected to enhance climate prediction accuracy while reducing computational complexity, making climate models more accessible and actionable. It can aid policymakers, industries, and communities in planning for climate risks, while offering the scientific community new insights into the application of polynomial approximations in environmental modeling. The work contributes to both sustainable development and mathematical modeling innovation."
  },
  {
    "PROGRAM MATHEMATICS:": 7,
    "__EMPTY": "Dr. Kamlesh Kumar",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Numerical Solution of Abel's Integral Equations",
    "__EMPTY_3": "In this project we will find the high order numerical solution of Abel's differential equation by using the different techniques of mathematical methods with stability analysis.",
    "__EMPTY_4": "Dr. Ramapati Maurya",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Vijay Kumar Yadav\r\nDepartment of Sciences (Mathematics), School of Sciences, Amity University, Haryana",
    "__EMPTY_8": "Sciences and Engineering",
    "__EMPTY_9": "Research paper ",
    "__EMPTY_10": "SDG 4,9 &13",
    "__EMPTY_11": "The project will provide new insights into the numerical behavior and stability properties of high-order methods when applied to Abel’s differential equation—a class of nonlinear differential equations known for their mathematical complexity. The research may lead to the derivation or refinement of algorithms that can be generalized to broader classes of nonlinear problems. Many engineering, physics, and biological systems are modeled using nonlinear differential equations. Improved numerical methods for solving such equations can enhance the accuracy and reliability of simulations in industries like aerospace, biomedical engineering, and climate modeling."
  },
  {
    "PROGRAM MATHEMATICS:": 8,
    "__EMPTY": "Dr. Ramapati Maurya",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Modelling the application of renewable energy resources for Sustainable Development",
    "__EMPTY_3": "The objective of this project is to develop a model that demonstrates the effective application of renewable energy resources—such as solar, wind, and hydro—to meet energy demands in a sustainable and cost-efficient manner. This model will simulate energy generation, usage, and optimization under real-world constraints, aiming to reduce dependency on fossil fuels, lower carbon emissions, and promote sustainable development.",
    "__EMPTY_4": "Dr. Vinayak V. Pathak & Dr. M. Javed Idrisi",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "NA",
    "__EMPTY_8": "Sciences and Engineering",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG 2, 7, 11, 13",
    "__EMPTY_11": "Expected Impact on Industry:\r\nThe project will drive innovation in renewable energy technologies, attract investment in green infrastructure, generate employment opportunities, and support industries in transitioning towards cost-effective and resilient energy systems.\r\n\r\nContribution to New Knowledge:\r\nThe project will contribute to the development of integrated modelling frameworks for renewable energy deployment, offer data-driven insights for energy planning, and provide scientific support for policy-making in the context of sustainable development."
  },
  {
    "PROGRAM MATHEMATICS:": 9,
    "__EMPTY": "Dr. Ruchi Gupta",
    "__EMPTY_1": "Assoc. Prof. ",
    "__EMPTY_2": "Applications of Navier-Stokes Equation",
    "__EMPTY_3": "It involves practical applications in aerospace, mechanical, and civil engineering for designing systems involving fluid flow, such as aircraft, pipelines, and ventilation systems.",
    "__EMPTY_4": "Dr. J. P. Sharma & Dr. M. Javed Idrisi",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. M. Shahbaz Ullah, Department of Mathematics, NSUT, New Delhi",
    "__EMPTY_8": "Sciences and ME",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG'S- 9,7&13",
    "__EMPTY_11": "Our project could refine existing computational models or propose novel approaches to solving the Navier-Stokes Equation, contributing to theoretical fluid mechanics, numerical analysis, and real-world engineering applications."
  },
  {
    "PROGRAM MATHEMATICS:": 10,
    "__EMPTY": "Ms. Seema Aggarwal",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Numerical Methods for Solving Differential Equations",
    "__EMPTY_3": "This involves Implement and compare different numerical techniques (Euler’s method, Runge-Kutta methods, etc.) for solving ordinary differential equations and analyze their accuracy and efficiency for real-world problems .",
    "__EMPTY_4": "Dr. Smrati Mishra , Dr. Nitika  ",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr.Chhavi rathi,\r\nDepartment of Engineering and Technology,Bharti Vidyapeeth ,Navi Mumbai",
    "__EMPTY_8": "Sciences and Engineering",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG'S- 9,7&13",
    "__EMPTY_11": "This project would enable accurate modeling of complex systems, driving innovation in science, engineering, and industry. They improve predictions, optimize designs, reduce costs, enhance safety, and contribute to new scientific knowledge where analytical solutions are not possible."
  },
  {
    "PROGRAM MATHEMATICS:": 11,
    "__EMPTY": "Dr. M. Javed Idrisi",
    "__EMPTY_1": "Professor",
    "__EMPTY_2": "To study the motion of test particle in the vicinity of dominant primaries",
    "__EMPTY_3": "This study integrates the concepts and methods of Celestial Mechanics, Differential Equations and Nonlinear Dynamical Systems.",
    "__EMPTY_4": "Dr. Ruchi Gupta & Dr. Advin",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. M. Shahbaz Ullah, Department of Mathematics, NSUT, New Delhi",
    "__EMPTY_8": "Physics, Maths, Aerospace",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG 4,9 &13",
    "__EMPTY_11": "Our project deepens theoretical understanding in astrodynamics and gravitational systems, potentially contributing to novel solutions in orbital mechanics, Lagrangian point dynamics, and interplanetary mission design."
  },
  {
    "PROGRAM MATHEMATICS:": 12,
    "__EMPTY": "Dr. Kushal Lalwani",
    "__EMPTY_1": "Asstt. Prof.",
    "__EMPTY_2": "Applications of \r\nMetric Spaces \r\nin Computer Science",
    "__EMPTY_3": "This will explore the use of metric spaces in areas such as machine learning, computer vision, and networking.",
    "__EMPTY_4": "Dr. Ramapati Maurya",
    "__EMPTY_5": "NA",
    "__EMPTY_6": "NA",
    "__EMPTY_7": "Dr. Ankit Gupta, Bharti College, University of Delhi",
    "__EMPTY_8": "Sciences and CSE",
    "__EMPTY_9": "Research paper",
    "__EMPTY_10": "SDG 4,9",
    "__EMPTY_11": "The project enhances user experiences and improves security by using facial recognition in devices and image comparison, pattern recognition that depends on defining distances in high-dimensional metric spaces."
  }
]